Tekla.Structures.Drawing.Rectangle
The Rectangle class defines a rectangle that is a box made of four lines with orthogonal angles.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Rectangle MyRectangle;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyRectangle = new Rectangle(views.Current as ViewBase, new Point(10,10), new Point(300,300));
MyRectangle.Insert();
}
}
}
}

Tekla.Structures.Drawing.Rectangle.StartPoint
The start point of the rectangle. Changing
this will move the rectangle.

Tekla.Structures.Drawing.Rectangle.EndPoint
The end point of the rectangle.

Tekla.Structures.Drawing.Rectangle.Width
The width of the rectangle.
Changing the width changes the end point with the width.

Tekla.Structures.Drawing.Rectangle.Height
The height of the rectangle.
Changing the height changes the end point with the height.

Tekla.Structures.Drawing.Rectangle.Angle
The angle of the rectangle. The rectangle rotates around its start point.

Tekla.Structures.Drawing.Rectangle.Attributes
The attributes of the rectangle.

Tekla.Structures.Drawing.Rectangle.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Rectangle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Rectangle.RectangleAttributes)
Creates a new rectangle instance with two points using the given attributes.
Please note that creating a rectangle using two points will re-calculate
the start point to correspond with positive widths and heights.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.
attributes: The rectangle attributes to be used.

Tekla.Structures.Drawing.Rectangle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new rectangle instance with two points using standard attributes.
Please note that creating a rectangle using two points will re-calculate
the start point to correspond with positive widths and heights.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.

Tekla.Structures.Drawing.Rectangle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.Rectangle.RectangleAttributes)
Creates a new rectangle instance with the start point and the defined width and height using the given attributes.
view: The view to be used.
startPoint: The start point to be used.
width: The width to be used.
height: The height to be used.
attributes: The rectangle attributes to be used.

Tekla.Structures.Drawing.Rectangle.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.Double,System.Double)
Creates a new rectangle instance with the start point and the defined width and height using standard attributes.
view: The view to be used.
startPoint: The start point to be used.
width: The width to be used.
height: The height to be used.

Tekla.Structures.Drawing.Rectangle.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Rectangle.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Rectangle.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Rectangle.Select
Calls the system to select and retrieve the object.
Returns: True on success.